let btn = document.querySelector('.btn');
let p = document.querySelector('#answear');
let scrolling = document.querySelector('#scrolling');

let WhyILoveY = ['Тому що ти завжди робиш мій день яскравішим', 'Тому що ти завжди віриш у мене', 'Тому що ти надихаєш мене', 'Тому що ти унікальна і особлива', 'Тому що ти моя маленька', 'Тому що твоя посмішка робить мій день яскравішим і радіснішим', 'Тому що наше спільне майбутнє виглядає захопливим та обіцяючим', 'Тому що наша любов зростає з кожним днем, і я вірю, що ми - найкраща команда', 'Тому що ти - найважливіша людина у моєму житті, і я завжди готовий докласти всіх зусиль для твого щастя', 'Тому що твої теплі обійми завжди роблять мене коханим', 'Тому що твої вміння бути терплячою і розуміючою дозволяють подолати будь-які труднощі', 'Тому що ти мій найкращий друг, з яким можна поділитися всім', 'Тому що ти завжди готова вислухати мене, коли мені потрібно поділитися своїми думками і переживаннями', 'Тому що ти моя маленька'];

let currentIndex = 0;

btn.addEventListener('click', function(){
  if (currentIndex < WhyILoveY.length) {
    p.textContent = WhyILoveY[currentIndex]; // Виводимо поточний елемент масиву
    currentIndex++; // Збільшуємо індекс для наступного виведення
  } else {
    p.textContent = 'Ти найкраща'; // Якщо всі причини вже виведені
  }
});

scrolling.addEventListener('click', function(){
  window.scrollBy({
    top: 6700, // Відстань в пікселях, на яку прокручуємо сторінку
    behavior: 'smooth' // Додаємо плавний ефект прокрутки
  });
});